swat-4-dp/src/main/soma/service-export.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <dp:request xmlns:dp="http://www.datapower.com/schemas/management" domain="@domain.name@">
            <dp:do-export format="ZIP">
                <dp:object class="@export.service.object.class@" name="@export.service.object.name@" ref-objects="true" ref-files="true" />
                @export.service.objects.additional@
            </dp:do-export>
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>